studenti/diplomski_teme.org
#+TITLE: Teme za diplomske radove
#+SETUPFILE: teme_setup.org

* Slobodne teme (okvirne, konkretne teme u dogovoru sa mentorom)
- Razvoj softvera baziranog na komponentama
- Primena softverski obrazaca (dizajn, konkurentni, mikroservisni...)
- Programski jezici (analiza, prednosti, primene). Akcenat na tzv.
  /non-mainstream/ jezicima
- Parsiranje i analiza programskog koda, kreiranje jezika specifičnih za domen
  (videti [[http://textx.github.io/textX/stable/][textX]] i [[http://www.igordejanovic.net/parglare/stable/][parglare]])
- Tehnike vizualizacije podataka ([[https://pharo.org/][Pharo]] - [[http://agilevisualization.com/][Agile Visualisation]], JavaScript...)
- Alati i jezici za razvoj video igara. Akcenat na interaktivnoj fikciji (IF -
  /Interactive Fiction/).
  - [[https://github.com/tajmone/awesome-interactive-fiction][A curated list of interactive fiction frameworks, tools, and resources]]
- Alati i jezici za razvoj psiholoških testova (videti [[https://www.youtube.com/watch?v=tSFdYYnQmjA][pyFlies]] i [[https://en.wikipedia.org/wiki/Mental_chronometry][Mental Chronometry]])
- RustySteel - čitač ličnih karti na programskom jeziku Rust (po uzoru na
  [[http://jfreesteel.devbase.net/][JFreeSteel]]).

* U izradi
** Veljko Tošić: Aplikacija za podršku prevoza ljudi deljenjem vozila
- Tema izdata: avgust 2022.
** Dušan Antić: Aplikacija za pronalazak majstora kućnih poslova
- Tema izdata: avgust 2022.
** Marko Bjelica: Aplikacija za naručivanje hrane i pića zasnovana na mikroservisnoj arhitekturi
- Tema sa predmeta NTP. Rezervisano: avgust 2022.
** Miloš Popović: Veb aplikacija za organizovanje javnih kvizova
- Tema sa predmeta NTP. Rezervisano: jul 2022.
** Vladimir Jovin: Generator Python programskog koda za Silvera jezik
- Tema izdata: jul 2022.
** Milovan Milovanović: Platforma za gledanje i deljenje video sadržaja
- Tema sa predmeta NTP. Rezervisano: jul 2022.
** Albert Makan: Generator C# programskog koda za Silvera jezik
- Tema izdata: jul 2022.
** Loreana Olujić: Aplikacija za pretragu i rezervaciju avio karata
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Jelena Stojanović: Aplikacija za izbor biljaka bazirana na mikroservisnoj arhitekturi
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Daniel Božanić: mikroservisna aplikacija za korisnike računarskih igara
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Mladen Vasić: mikroservisna aplikacija za kupovinu i prodaju automobila
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Bojan Baškalo: Aplikacija za lakše pronalaženje/rezervaciju električnih punjača za automobil/bicikl/trotinet
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Zoran Jankov: aplikacija za kontrolu i praćenje verzija izvornog koda
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Nikola Petrović: aplikacija za diskusiju, ocenjivanje i pisanje recenzija o muzicarima, pesmama i albumima
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Isidora Stanić: Aplikacija za izbor podnih i zidnih obloga
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Dimitrije Karanfilović: Aplikacija za pretragu, ocenjivanje i naručivanje pića
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Nađa Gvozdenac: Veb aplikacija za biblioteku bazirana na mikroservisnoj arhitekturi
- Tema sa predmeta NTP. Rezervisano: jun 2022.
** Anastasija Đurić: Generator Go programskog koda za Silvera jezik
- Tema izdata: jun 2022.
** Miodrag Vilotijević: Digitalni marketing baziran na gejmifikaciji
- Tema izdata: decembar 2021.
** Marija Kastratović: GoBooking - portal za turističku agenciju baziran na mikroservisnoj arhitekturi
- Tema izdata: novembar 2021.
** Vladimir Gajčin: Razvoj aplikacija na programskom jeziku V
- Tema izdata: mart 2021.

** Dušan Srbulović: vizualizacija podataka iz CSV/JSON upotrebom Web tehnologija
- Tema izdata: februar 2021.

** Stevan Šinik: Generisanje liste autora (*contributors*) iz git repozitorijuma
- Tema izdata: mart 2020

  #+begin_quote
  Kreirati alat koji će analizirati istoriju zadatog git repozitorijuma i
  kreirati listu autora sa dodatnim informacijama (broj commit-a, broj
  dodatih/obrisanih linija koda). Omogućiti zadavanje putanje i/ili fajl
  ekstenzije nad kojom se izveštaj traži. Ideja je da se alat koristi kao
  jednostavan generator `CONTRIBUTORS.md` fajlova.
  #+end_quote
** Nikola Stajić: Desktop aplikacija za merenje reakcionog vremena
- Tema izdata: april 2019.

* Završene
** Aleksa Domić: Konvertor modela za Hardware-In-The-Loop simulacije
- Tema izdata: 2017, odbranjeno: maj 2022.

** David Drvar: razvoj mikroservisa na programskom jeziku Go
- Tema izdata: mart 2021, odbranjeno: decembar 2021.
** Matija Petrović: ClinicHub – portal za klinike baziran na mikroservisnoj arhitekturi
- Tema izdata: septembar 2021, odbranjeno: oktobar 2021.
- https://github.com/matijapetrovic/clinichub

** Aleksa Goljović: Portal za bioskop baziran na mikroservisnoj arhitekturi
- Tema izdata: septembar 2021, odbranjeno: oktobar 2021.
- https://github.com/aleksag12/go-cinema

** Bojan Popržen: Implementacija obrasca protočne obrade na programskom jeziku Go
- Tema izdata: septembar 2021, odbranjeno: oktobar 2021.
- https://github.com/ele7ija/go-pipelines

** Vladimir Rodušek: Grafički korisnički interfejs za dizajniranje i razvoj interaktivne fikcije
- Tema izdata: jun 2021, odbranjeno: oktobar 2021.
- https://github.com/rodusek-v/gui-tad
- Videti: [[https://github.com/tajmone/awesome-interactive-fiction][A curated list of interactive fiction frameworks, tools, and resources]]

** Petar Cerović: Elektronska servisna knjiga vozila
- Tema izdata: mart 2021, odbranjeno: oktobar 2021.

** Milena Laketić: Dizajn i implementacija softvera za analizu Smalltalk programskog koda
- Tema izdata: mart 2021, odbranjeno: septembar 2021.
- https://github.com/specnazm/smalltalk-parser

** Jelena Cupać: Razvoj mikroservisa na programskom jeziku Rust
- Tema izdata: april 2021, odbranjeno: septembar 2021.
- https://github.com/jelenac11/Rust-Microservices

** Damjan Manojlović: Simulacija preživljavanja populacije jedinki
- Tema izdata: avgust 2021, odbranjeno: septembar 2021.
- https://github.com/Damjan032/SurvivalSimulation

** Haris Gegić: vizualizacija algoritama i struktura podataka
- Tema izdata: februar 2021, odbranjeno: septembar 2021.
- https://github.com/gegic/alharismi

** Kristina Đereg: Kreiranje matrice rastojanja za rešavanje problema trgovačkog putnika
- Tema izdata: novembar 2020, odbranjeno: jun 2021.
- https://github.com/kristinadj/TSP-Matrix

** Vuk Vladisavljević: Razvoj mobilnih aplikacija upotrebom Flutter okvira i Dart programskog jezika
- Tema izdata: mart 2021, odbranjeno: jun 2021.
- https://github.com/VukVladisavljevic/crypto_tracker/

** Nemanja Žunić: Aplikacija za praćenje vremena provedenog u upotrebi mobilnog telefona
- Tema izdata: oktobar 2018; odbranjeno: decembar 2020.
- https://github.com/C0mpy/phone-usage-server
- https://github.com/C0mpy/phone-usage-app

** Ana Pjević: Optimizacija problema transporta paketa na programskom jeziku Go
- Tema izdata: novembar 2020; odbranjeno: decembar 2020.
- https://github.com/ancicii/NTP

** Ana Mijailović: Serijska i paralelna implementacija alata za manipulaciju fajlovima i folderima
- Tema izdata: jul 2020, odbranjeno: oktobar 2020.

** Mihajlo Jovković: Jezik i alat za kreiranje IF (Interactive Fiction) igara
- Tema izdata: jun 2020, odbranjeno: oktobar 2020.
- https://github.com/Misk23/IFCreationTool
- Videti: [[https://github.com/tajmone/awesome-interactive-fiction][A curated list of interactive fiction frameworks, tools, and resources]]

** Nikola Šarić: Društvena mreža za muzičare
- Tema izdata: septembar 2020, odbranjeno: oktobar 2020.
- https://github.com/NikolaSaric/ntp

** Milica Vojnović: Aplikacija za optimizaciju prevoza lekova i medicinske opreme između Covid centara
- Tema izdata: oktobar 2020, odbranjeno: oktobar 2020.

** Dušan Stević: Analiza serijske i paralelne implementacije algoritama baziranih na Monte Karlo metodi
- započeto: septembar 2020, Odbranjeno: oktobar 2020.
- https://github.com/DusanStevic/NTP

** Vukašin Janković: Web aplikacija za merenje reakcionog vremena
- Tema izdata: april 2019, odbranjeno: septembar 2020.
- https://github.com/vulevule/ReactionMate
- Videti:
  + https://en.wikipedia.org/wiki/Mental_chronometry
  + https://www.humanbenchmark.com/tests/reactiontime

** Dimitrije Mihajloviski: Genarator upitnika na bazi LaTeX-a
- Tema izdata: oktobar 2019, odbranjeno: jul 2020.
- https://github.com/dimmih/questionnaire

#+begin_quote
 Kreirati bazu pitanja i web aplikaciju za pretragu i ažuriranje baze. Na
 osnovu zadatih kriterijuma (broj pitanja, težina i sl.) generisati upitnik u
 pdf formatu (upotrebom LateX-a).
#+end_quote

** Dejan Šorgić: Migracija pyFlies jezika na textX 2 i PsychoPy 3
- Tema izdata: jul 2019, odbranjeno: oktobar 2019.
- Videti:
  + https://github.com/igordejanovic/pyFlies
  + https://www.psychopy.org/

** Simona Prokić: Web aplikacija za merenje reakcionog vremena
- Tema izdata: april 2019, odbranjeno: septembar 2019.
- Vue.js, Express, MongoDB
- Videti:
  + https://en.wikipedia.org/wiki/Mental_chronometry
  + https://www.humanbenchmark.com/tests/reactiontime
