studenti/diplomski_teme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-06 Tue 11:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Teme za diplomske radove</title>
<meta name="author" content="Igor Dejanović" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../orgcss/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Teme za diplomske radove</h1>

<div id="outline-container-org37b2148" class="outline-2">
<h2 id="org37b2148">Slobodne teme (okvirne, konkretne teme u dogovoru sa mentorom)</h2>
<div class="outline-text-2" id="text-org37b2148">
<ul class="org-ul">
<li>Razvoj softvera baziranog na komponentama</li>
<li>Primena softverski obrazaca (dizajn, konkurentni, mikroservisni&#x2026;)</li>
<li>Programski jezici (analiza, prednosti, primene). Akcenat na tzv.
<i>non-mainstream</i> jezicima</li>
<li>Parsiranje i analiza programskog koda, kreiranje jezika specifičnih za domen
(videti <a href="http://textx.github.io/textX/stable/">textX</a> i <a href="http://www.igordejanovic.net/parglare/stable/">parglare</a>)</li>
<li>Tehnike vizualizacije podataka (<a href="https://pharo.org/">Pharo</a> - <a href="http://agilevisualization.com/">Agile Visualisation</a>, JavaScript&#x2026;)</li>
<li>Alati i jezici za razvoj video igara. Akcenat na interaktivnoj fikciji (IF -
<i>Interactive Fiction</i>).
<ul class="org-ul">
<li><a href="https://github.com/tajmone/awesome-interactive-fiction">A curated list of interactive fiction frameworks, tools, and resources</a></li>
</ul></li>
<li>Alati i jezici za razvoj psiholoških testova (videti <a href="https://www.youtube.com/watch?v=tSFdYYnQmjA">pyFlies</a> i <a href="https://en.wikipedia.org/wiki/Mental_chronometry">Mental Chronometry</a>)</li>
<li>RustySteel - čitač ličnih karti na programskom jeziku Rust (po uzoru na
<a href="http://jfreesteel.devbase.net/">JFreeSteel</a>).</li>
</ul>
</div>
</div>

<div id="outline-container-orgae4a208" class="outline-2">
<h2 id="orgae4a208">U izradi</h2>
<div class="outline-text-2" id="text-orgae4a208">
</div>
<div id="outline-container-org0ee038c" class="outline-3">
<h3 id="org0ee038c">Veljko Tošić: Aplikacija za podršku prevoza ljudi deljenjem vozila</h3>
<div class="outline-text-3" id="text-org0ee038c">
<ul class="org-ul">
<li>Tema izdata: avgust 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org43512c0" class="outline-3">
<h3 id="org43512c0">Dušan Antić: Aplikacija za pronalazak majstora kućnih poslova</h3>
<div class="outline-text-3" id="text-org43512c0">
<ul class="org-ul">
<li>Tema izdata: avgust 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org9cbc441" class="outline-3">
<h3 id="org9cbc441">Marko Bjelica: Aplikacija za naručivanje hrane i pića zasnovana na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-org9cbc441">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: avgust 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf324aeb" class="outline-3">
<h3 id="orgf324aeb">Miloš Popović: Veb aplikacija za organizovanje javnih kvizova</h3>
<div class="outline-text-3" id="text-orgf324aeb">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jul 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb64aa5" class="outline-3">
<h3 id="orgbb64aa5">Vladimir Jovin: Generator Python programskog koda za Silvera jezik</h3>
<div class="outline-text-3" id="text-orgbb64aa5">
<ul class="org-ul">
<li>Tema izdata: jul 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf348645" class="outline-3">
<h3 id="orgf348645">Milovan Milovanović: Platforma za gledanje i deljenje video sadržaja</h3>
<div class="outline-text-3" id="text-orgf348645">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jul 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org6893e02" class="outline-3">
<h3 id="org6893e02">Albert Makan: Generator C# programskog koda za Silvera jezik</h3>
<div class="outline-text-3" id="text-org6893e02">
<ul class="org-ul">
<li>Tema izdata: jul 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org0a0a468" class="outline-3">
<h3 id="org0a0a468">Loreana Olujić: Aplikacija za pretragu i rezervaciju avio karata</h3>
<div class="outline-text-3" id="text-org0a0a468">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org195c21a" class="outline-3">
<h3 id="org195c21a">Jelena Stojanović: Aplikacija za izbor biljaka bazirana na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-org195c21a">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org114bca2" class="outline-3">
<h3 id="org114bca2">Daniel Božanić: mikroservisna aplikacija za korisnike računarskih igara</h3>
<div class="outline-text-3" id="text-org114bca2">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdcae3e1" class="outline-3">
<h3 id="orgdcae3e1">Mladen Vasić: mikroservisna aplikacija za kupovinu i prodaju automobila</h3>
<div class="outline-text-3" id="text-orgdcae3e1">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org675e6c2" class="outline-3">
<h3 id="org675e6c2">Bojan Baškalo: Aplikacija za lakše pronalaženje/rezervaciju električnih punjača za automobil/bicikl/trotinet</h3>
<div class="outline-text-3" id="text-org675e6c2">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org16f68b3" class="outline-3">
<h3 id="org16f68b3">Zoran Jankov: aplikacija za kontrolu i praćenje verzija izvornog koda</h3>
<div class="outline-text-3" id="text-org16f68b3">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgea206bc" class="outline-3">
<h3 id="orgea206bc">Nikola Petrović: aplikacija za diskusiju, ocenjivanje i pisanje recenzija o muzicarima, pesmama i albumima</h3>
<div class="outline-text-3" id="text-orgea206bc">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc5a0366" class="outline-3">
<h3 id="orgc5a0366">Isidora Stanić: Aplikacija za izbor podnih i zidnih obloga</h3>
<div class="outline-text-3" id="text-orgc5a0366">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org778a58f" class="outline-3">
<h3 id="org778a58f">Dimitrije Karanfilović: Aplikacija za pretragu, ocenjivanje i naručivanje pića</h3>
<div class="outline-text-3" id="text-org778a58f">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-orgade6ed8" class="outline-3">
<h3 id="orgade6ed8">Nađa Gvozdenac: Veb aplikacija za biblioteku bazirana na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-orgade6ed8">
<ul class="org-ul">
<li>Tema sa predmeta NTP. Rezervisano: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org68cc2f1" class="outline-3">
<h3 id="org68cc2f1">Anastasija Đurić: Generator Go programskog koda za Silvera jezik</h3>
<div class="outline-text-3" id="text-org68cc2f1">
<ul class="org-ul">
<li>Tema izdata: jun 2022.</li>
</ul>
</div>
</div>
<div id="outline-container-org29ce410" class="outline-3">
<h3 id="org29ce410">Miodrag Vilotijević: Digitalni marketing baziran na gejmifikaciji</h3>
<div class="outline-text-3" id="text-org29ce410">
<ul class="org-ul">
<li>Tema izdata: decembar 2021.</li>
</ul>
</div>
</div>
<div id="outline-container-orgeabb33e" class="outline-3">
<h3 id="orgeabb33e">Marija Kastratović: GoBooking - portal za turističku agenciju baziran na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-orgeabb33e">
<ul class="org-ul">
<li>Tema izdata: novembar 2021.</li>
</ul>
</div>
</div>
<div id="outline-container-org7309bed" class="outline-3">
<h3 id="org7309bed">Vladimir Gajčin: Razvoj aplikacija na programskom jeziku V</h3>
<div class="outline-text-3" id="text-org7309bed">
<ul class="org-ul">
<li>Tema izdata: mart 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-org2514681" class="outline-3">
<h3 id="org2514681">Dušan Srbulović: vizualizacija podataka iz CSV/JSON upotrebom Web tehnologija</h3>
<div class="outline-text-3" id="text-org2514681">
<ul class="org-ul">
<li>Tema izdata: februar 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-org4bbafdb" class="outline-3">
<h3 id="org4bbafdb">Stevan Šinik: Generisanje liste autora (<b>contributors</b>) iz git repozitorijuma</h3>
<div class="outline-text-3" id="text-org4bbafdb">
<ul class="org-ul">
<li><p>
Tema izdata: mart 2020
</p>

<blockquote>
<p>
Kreirati alat koji će analizirati istoriju zadatog git repozitorijuma i
kreirati listu autora sa dodatnim informacijama (broj commit-a, broj
dodatih/obrisanih linija koda). Omogućiti zadavanje putanje i/ili fajl
ekstenzije nad kojom se izveštaj traži. Ideja je da se alat koristi kao
jednostavan generator `CONTRIBUTORS.md` fajlova.
</p>
</blockquote></li>
</ul>
</div>
</div>
<div id="outline-container-org92be7d3" class="outline-3">
<h3 id="org92be7d3">Nikola Stajić: Desktop aplikacija za merenje reakcionog vremena</h3>
<div class="outline-text-3" id="text-org92be7d3">
<ul class="org-ul">
<li>Tema izdata: april 2019.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfa5238d" class="outline-2">
<h2 id="orgfa5238d">Završene</h2>
<div class="outline-text-2" id="text-orgfa5238d">
</div>
<div id="outline-container-org7a0a233" class="outline-3">
<h3 id="org7a0a233">Aleksa Domić: Konvertor modela za Hardware-In-The-Loop simulacije</h3>
<div class="outline-text-3" id="text-org7a0a233">
<ul class="org-ul">
<li>Tema izdata: 2017, odbranjeno: maj 2022.</li>
</ul>
</div>
</div>

<div id="outline-container-org12cf0cc" class="outline-3">
<h3 id="org12cf0cc">David Drvar: razvoj mikroservisa na programskom jeziku Go</h3>
<div class="outline-text-3" id="text-org12cf0cc">
<ul class="org-ul">
<li>Tema izdata: mart 2021, odbranjeno: decembar 2021.</li>
</ul>
</div>
</div>
<div id="outline-container-org34ebb78" class="outline-3">
<h3 id="org34ebb78">Matija Petrović: ClinicHub – portal za klinike baziran na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-org34ebb78">
<ul class="org-ul">
<li>Tema izdata: septembar 2021, odbranjeno: oktobar 2021.</li>
<li><a href="https://github.com/matijapetrovic/clinichub">https://github.com/matijapetrovic/clinichub</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb9a36e3" class="outline-3">
<h3 id="orgb9a36e3">Aleksa Goljović: Portal za bioskop baziran na mikroservisnoj arhitekturi</h3>
<div class="outline-text-3" id="text-orgb9a36e3">
<ul class="org-ul">
<li>Tema izdata: septembar 2021, odbranjeno: oktobar 2021.</li>
<li><a href="https://github.com/aleksag12/go-cinema">https://github.com/aleksag12/go-cinema</a></li>
</ul>
</div>
</div>

<div id="outline-container-org6e7712e" class="outline-3">
<h3 id="org6e7712e">Bojan Popržen: Implementacija obrasca protočne obrade na programskom jeziku Go</h3>
<div class="outline-text-3" id="text-org6e7712e">
<ul class="org-ul">
<li>Tema izdata: septembar 2021, odbranjeno: oktobar 2021.</li>
<li><a href="https://github.com/ele7ija/go-pipelines">https://github.com/ele7ija/go-pipelines</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga4f6068" class="outline-3">
<h3 id="orga4f6068">Vladimir Rodušek: Grafički korisnički interfejs za dizajniranje i razvoj interaktivne fikcije</h3>
<div class="outline-text-3" id="text-orga4f6068">
<ul class="org-ul">
<li>Tema izdata: jun 2021, odbranjeno: oktobar 2021.</li>
<li><a href="https://github.com/rodusek-v/gui-tad">https://github.com/rodusek-v/gui-tad</a></li>
<li>Videti: <a href="https://github.com/tajmone/awesome-interactive-fiction">A curated list of interactive fiction frameworks, tools, and resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org078745f" class="outline-3">
<h3 id="org078745f">Petar Cerović: Elektronska servisna knjiga vozila</h3>
<div class="outline-text-3" id="text-org078745f">
<ul class="org-ul">
<li>Tema izdata: mart 2021, odbranjeno: oktobar 2021.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc2309ab" class="outline-3">
<h3 id="orgc2309ab">Milena Laketić: Dizajn i implementacija softvera za analizu Smalltalk programskog koda</h3>
<div class="outline-text-3" id="text-orgc2309ab">
<ul class="org-ul">
<li>Tema izdata: mart 2021, odbranjeno: septembar 2021.</li>
<li><a href="https://github.com/specnazm/smalltalk-parser">https://github.com/specnazm/smalltalk-parser</a></li>
</ul>
</div>
</div>

<div id="outline-container-orge32a1f8" class="outline-3">
<h3 id="orge32a1f8">Jelena Cupać: Razvoj mikroservisa na programskom jeziku Rust</h3>
<div class="outline-text-3" id="text-orge32a1f8">
<ul class="org-ul">
<li>Tema izdata: april 2021, odbranjeno: septembar 2021.</li>
<li><a href="https://github.com/jelenac11/Rust-Microservices">https://github.com/jelenac11/Rust-Microservices</a></li>
</ul>
</div>
</div>

<div id="outline-container-org206d757" class="outline-3">
<h3 id="org206d757">Damjan Manojlović: Simulacija preživljavanja populacije jedinki</h3>
<div class="outline-text-3" id="text-org206d757">
<ul class="org-ul">
<li>Tema izdata: avgust 2021, odbranjeno: septembar 2021.</li>
<li><a href="https://github.com/Damjan032/SurvivalSimulation">https://github.com/Damjan032/SurvivalSimulation</a></li>
</ul>
</div>
</div>

<div id="outline-container-org99a88ba" class="outline-3">
<h3 id="org99a88ba">Haris Gegić: vizualizacija algoritama i struktura podataka</h3>
<div class="outline-text-3" id="text-org99a88ba">
<ul class="org-ul">
<li>Tema izdata: februar 2021, odbranjeno: septembar 2021.</li>
<li><a href="https://github.com/gegic/alharismi">https://github.com/gegic/alharismi</a></li>
</ul>
</div>
</div>

<div id="outline-container-org81b94d3" class="outline-3">
<h3 id="org81b94d3">Kristina Đereg: Kreiranje matrice rastojanja za rešavanje problema trgovačkog putnika</h3>
<div class="outline-text-3" id="text-org81b94d3">
<ul class="org-ul">
<li>Tema izdata: novembar 2020, odbranjeno: jun 2021.</li>
<li><a href="https://github.com/kristinadj/TSP-Matrix">https://github.com/kristinadj/TSP-Matrix</a></li>
</ul>
</div>
</div>

<div id="outline-container-org66eb02a" class="outline-3">
<h3 id="org66eb02a">Vuk Vladisavljević: Razvoj mobilnih aplikacija upotrebom Flutter okvira i Dart programskog jezika</h3>
<div class="outline-text-3" id="text-org66eb02a">
<ul class="org-ul">
<li>Tema izdata: mart 2021, odbranjeno: jun 2021.</li>
<li><a href="https://github.com/VukVladisavljevic/crypto_tracker/">https://github.com/VukVladisavljevic/crypto_tracker/</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbadda71" class="outline-3">
<h3 id="orgbadda71">Nemanja Žunić: Aplikacija za praćenje vremena provedenog u upotrebi mobilnog telefona</h3>
<div class="outline-text-3" id="text-orgbadda71">
<ul class="org-ul">
<li>Tema izdata: oktobar 2018; odbranjeno: decembar 2020.</li>
<li><a href="https://github.com/C0mpy/phone-usage-server">https://github.com/C0mpy/phone-usage-server</a></li>
<li><a href="https://github.com/C0mpy/phone-usage-app">https://github.com/C0mpy/phone-usage-app</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0fe8c75" class="outline-3">
<h3 id="org0fe8c75">Ana Pjević: Optimizacija problema transporta paketa na programskom jeziku Go</h3>
<div class="outline-text-3" id="text-org0fe8c75">
<ul class="org-ul">
<li>Tema izdata: novembar 2020; odbranjeno: decembar 2020.</li>
<li><a href="https://github.com/ancicii/NTP">https://github.com/ancicii/NTP</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbf09f29" class="outline-3">
<h3 id="orgbf09f29">Ana Mijailović: Serijska i paralelna implementacija alata za manipulaciju fajlovima i folderima</h3>
<div class="outline-text-3" id="text-orgbf09f29">
<ul class="org-ul">
<li>Tema izdata: jul 2020, odbranjeno: oktobar 2020.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf1877c2" class="outline-3">
<h3 id="orgf1877c2">Mihajlo Jovković: Jezik i alat za kreiranje IF (Interactive Fiction) igara</h3>
<div class="outline-text-3" id="text-orgf1877c2">
<ul class="org-ul">
<li>Tema izdata: jun 2020, odbranjeno: oktobar 2020.</li>
<li><a href="https://github.com/Misk23/IFCreationTool">https://github.com/Misk23/IFCreationTool</a></li>
<li>Videti: <a href="https://github.com/tajmone/awesome-interactive-fiction">A curated list of interactive fiction frameworks, tools, and resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org321e396" class="outline-3">
<h3 id="org321e396">Nikola Šarić: Društvena mreža za muzičare</h3>
<div class="outline-text-3" id="text-org321e396">
<ul class="org-ul">
<li>Tema izdata: septembar 2020, odbranjeno: oktobar 2020.</li>
<li><a href="https://github.com/NikolaSaric/ntp">https://github.com/NikolaSaric/ntp</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaedfc03" class="outline-3">
<h3 id="orgaedfc03">Milica Vojnović: Aplikacija za optimizaciju prevoza lekova i medicinske opreme između Covid centara</h3>
<div class="outline-text-3" id="text-orgaedfc03">
<ul class="org-ul">
<li>Tema izdata: oktobar 2020, odbranjeno: oktobar 2020.</li>
</ul>
</div>
</div>

<div id="outline-container-org5ede7bd" class="outline-3">
<h3 id="org5ede7bd">Dušan Stević: Analiza serijske i paralelne implementacije algoritama baziranih na Monte Karlo metodi</h3>
<div class="outline-text-3" id="text-org5ede7bd">
<ul class="org-ul">
<li>započeto: septembar 2020, Odbranjeno: oktobar 2020.</li>
<li><a href="https://github.com/DusanStevic/NTP">https://github.com/DusanStevic/NTP</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4630537" class="outline-3">
<h3 id="org4630537">Vukašin Janković: Web aplikacija za merenje reakcionog vremena</h3>
<div class="outline-text-3" id="text-org4630537">
<ul class="org-ul">
<li>Tema izdata: april 2019, odbranjeno: septembar 2020.</li>
<li><a href="https://github.com/vulevule/ReactionMate">https://github.com/vulevule/ReactionMate</a></li>
<li>Videti:
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Mental_chronometry">https://en.wikipedia.org/wiki/Mental_chronometry</a></li>
<li><a href="https://www.humanbenchmark.com/tests/reactiontime">https://www.humanbenchmark.com/tests/reactiontime</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga604b40" class="outline-3">
<h3 id="orga604b40">Dimitrije Mihajloviski: Genarator upitnika na bazi LaTeX-a</h3>
<div class="outline-text-3" id="text-orga604b40">
<ul class="org-ul">
<li>Tema izdata: oktobar 2019, odbranjeno: jul 2020.</li>
<li><a href="https://github.com/dimmih/questionnaire">https://github.com/dimmih/questionnaire</a></li>
</ul>

<blockquote>
<p>
Kreirati bazu pitanja i web aplikaciju za pretragu i ažuriranje baze. Na
osnovu zadatih kriterijuma (broj pitanja, težina i sl.) generisati upitnik u
pdf formatu (upotrebom LateX-a).
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org30cc5b2" class="outline-3">
<h3 id="org30cc5b2">Dejan Šorgić: Migracija pyFlies jezika na textX 2 i PsychoPy 3</h3>
<div class="outline-text-3" id="text-org30cc5b2">
<ul class="org-ul">
<li>Tema izdata: jul 2019, odbranjeno: oktobar 2019.</li>
<li>Videti:
<ul class="org-ul">
<li><a href="https://github.com/igordejanovic/pyFlies">https://github.com/igordejanovic/pyFlies</a></li>
<li><a href="https://www.psychopy.org/">https://www.psychopy.org/</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb5599ea" class="outline-3">
<h3 id="orgb5599ea">Simona Prokić: Web aplikacija za merenje reakcionog vremena</h3>
<div class="outline-text-3" id="text-orgb5599ea">
<ul class="org-ul">
<li>Tema izdata: april 2019, odbranjeno: septembar 2019.</li>
<li>Vue.js, Express, MongoDB</li>
<li>Videti:
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Mental_chronometry">https://en.wikipedia.org/wiki/Mental_chronometry</a></li>
<li><a href="https://www.humanbenchmark.com/tests/reactiontime">https://www.humanbenchmark.com/tests/reactiontime</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Igor Dejanović</p>
<p class="date">Created: 2022-09-06 Tue 11:18</p>
</div>
</body>
</html>
